today = "2026-04-30"
token = "YOUR_TOKEN_HERE"
positionMaps = {
    "H30533": "中国互联网50",
    "399296": "创成长",
    "931139": "CS消费50",
    "931484": "CS医药创新",
    "399295": "创业蓝筹",
    "931052": "国信价值",
    "399441": "生物医药",
    "930641": "中证中药",
    "399324": "深证红利",
    "399814": "大农业",
    "000941": "新能源汽车",
    "399965": "800地产",
    "931798": "光伏龙头30",
    "931468": "红利质量",
    "399991": "一带一路",
    "399997": "中证白酒",
    "931068": "消费龙头",
    "HSCGSI": "恒生消费指数"
}
observationPositionMaps = {
}